IdeaRS.OpenModel.Detail.Beam
Representation of 1D member in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.Beam.#ctor
Constructor

IdeaRS.OpenModel.Detail.Beam.GeomId
Id representing geometrical parts of Detail

IdeaRS.OpenModel.Detail.Beam.MasterComponent
Master component

IdeaRS.OpenModel.Detail.Beam.MasterPoint
Master point 0 - 9

IdeaRS.OpenModel.Detail.Beam.InsertPoint
Insert point 0 - 9

IdeaRS.OpenModel.Detail.Beam.Edges
Lines of Element2D including edges, which are created by opening

IdeaRS.OpenModel.Detail.Beam.Position
Offset between MasterPoint and InsertPoint
If MasterPoint is null, position is from origin of coordinate system